export default {
	// 登录认证
	10000: '成功',
	10001: '没有token',
	10002: 'token无效',
	10003: '无权限验证不通过',
	10004: '参数校验不通过',

	// 用户
	11000: '用户列表查询错误',
	11001: '用户不存在',
	11002: '用户创建失败',
	11003: '用户更新失败',
	11004: '用户删除失败',

	// 视频
	12000: '视频列表查询错误',
	12001: '视频不存在',
	12002: '视频创建失败',
	12003: '视频更新失败',
	12004: '视频删除失败',

	// 漫画
	13000: '漫画列表查询错误',
	13001: '漫画不存在',
	13002: '漫画创建失败',
	13003: '漫画更新失败',
	13004: '漫画删除失败',

	// 配置
	14000: '配置获取错误',
	14001: '配置保存失败',

	// 弹幕
	15000: '弹幕列表查询错误',
	15001: '弹幕不存在',
	15002: '弹幕创建失败',
	15003: '弹幕更新失败',
	15004: '弹幕删除失败',

	// 分类
	16000: '分类列表查询错误',
	16001: '分类不存在',
	16002: '分类创建失败',
	16003: '分类更新失败',
	16004: '分类删除失败'
};
