export default {
    // 登录认证
    10000: '成功',
    10001: '没有token',
    10002: 'token无效',
    10003: '无权限验证不通过',
    10004: '参数校验不通过',
    10005: '用户名已存在',
    10006: '用户名不存在',
    10007: '邮箱已被使用',
    10008: '密码错误',
    10009: '注册失败',
    10010: '用户不存在',
    10011: '修改密码失败',
    10012: '邮箱不存在',
    10013: '未知错误',

    // 用户
    11000: '用户列表查询错误',
    11001: '用户不存在',
    11002: '用户创建失败',
    11003: '用户更新失败',
    11004: '用户删除失败',
    11005: '用户信息查询失败',
    11006: '用户充值失败',
    11007: '用户余额不足',

    // 视频
    12000: '视频列表查询错误',
    12001: '视频不存在',
    12002: '视频创建失败',
    12003: '视频更新失败',
    12004: '视频删除失败',

    // 漫画
    13000: '漫画列表查询错误',
    13001: '漫画不存在',
    13002: '漫画创建失败',
    13003: '漫画更新失败',
    13004: '漫画删除失败',

    // 文章
    14000: '文章列表查询错误',
    14001: '文章不存在',
    14002: '文章创建失败',
    14003: '文章更新失败',
    14004: '文章删除失败',

    // 弹幕
    15000: '弹幕列表查询错误',
    15001: '弹幕不存在',
    15002: '弹幕创建失败',
    15003: '弹幕更新失败',
    15004: '弹幕删除失败',

    // 分类
    16000: '分类列表查询错误',
    16001: '分类不存在',
    16002: '分类创建失败',
    16003: '分类更新失败',
    16004: '分类删除失败',

    // 评论
    17000: '评论列表查询错误',
    17001: '评论不存在',
    17002: '评论创建失败',
    17003: '评论更新失败',
    17004: '评论删除失败',

    // 剧集
    18000: '剧集列表查询错误',
    18001: '剧集不存在',
    18002: '剧集创建失败',
    18003: '剧集更新失败',
    18004: '剧集删除失败',

    // 激活码
    19000: '激活码列表查询错误',
    19001: '激活码不存在',
    19002: '激活码创建失败',
    19003: '激活码更新失败',
    19004: '激活码删除失败',
    19005: '激活码已使用',

    // 订单
    20000: '订单号无效',
    20001: '订单不存在',
    20002: '订单创建失败',
    20003: '订单更新失败',
    20004: '订单删除失败',
    20005: '余额不足',

    // 商品
    21000: '商品列表查询错误',
    21001: '商品不存在',
    21002: '商品创建失败',
    21003: '商品更新失败',
    21004: '商品删除失败',

    // 配置
    22000: '配置获取错误',
    22001: '配置保存失败',

    // 举报
    23000: '举报列表查询错误',
    23001: '举报不存在',
    23002: '举报创建失败',
    23003: '举报更新失败',
    23004: '举报删除失败',
    23005: '不可重复举报',

    // 订单
    24000: '订单列表查询错误',
    24001: '订单不存在',
    24002: '订单创建失败',
    24003: '订单更新失败',
    24004: '订单删除失败',

    // 上传
    25000: '上传失败',
    25001: '图片查询失败',
    25002: '图片删除失败',

    // 统计
    26000: '数据查询失败',
    26001: '记录创建失败',

    // 工具
    27000: '开始更新,请耐心等待',
    27001: '更新出错, 请检查文件权限等',
    27002: '消息获取失败',
    27003: '图片下载失败',
    27004: 'JSON导入失败',

    // 资源库
    28000: '列表获取错误',
    28001: '配置获取错误',
    28002: '配置更新失败',
    28003: '保存失败',
    28004: 'JSON导入失败',

    // 评分
    29000: '评分列表查询错误',
    29001: '评分不存在',
    29002: '评分创建失败',
    29003: '评分更新失败',
    29004: '评分删除失败',
    29005: '不可重复提交评分',
};
